press/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale             1;

bD               -1;
bU                1;
bL               -1;
bR                1;
bk               -1;
fr                1;

vertices
(
    ($bL $bD $bk)
    ($bL $bD $fr)
    ($bR $bD $bk)
    ($bR $bD $fr)
    ($bR $bU $bk)
    ($bR $bU $fr)
    ($bL $bU $bk)
    ($bL $bU $fr)
);

blocks
(
    hex ( 0 2 4 6 1 3 5 7) (100 100 1) simpleGrading (1  1  1) // 0
);

edges
(

);

boundary
(
    down
    {
        type wall;
        faces
        (
            (0 2 3 1)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 4 5 3)
        );
    }
    up
    {
        type wall;
        faces
        (
            (4 6 7 5)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 6 7 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
